#FastApiStudy\app\routes\math_routes.py
"""
Модуль математичних операцій.
Демонструє роботу з параметрами шляху (Path parameters) та автоматичну
валідацію типів даних у FastAPI.
"""
from fastapi import APIRouter

# Створення роутера з префіксом math та відповідним тегом для документації
router = APIRouter(prefix="/math", tags=["Математичні операції"])

# 1. Маршрут для суми /math/sum/{a}/{b}
@router.get(
    "/sum/{a}/{b}",
    summary="Додавання двох чисел",
    description="Приймає два цілих числа (Path-параметри) та повертає їхню суму."
    )
async def sum_numbers(a: int, b: int):
    """
    Виконує арифметичне додавання двох цілих чисел.

    Аргументи:
    - **a** (int): Перше число, отримане зі шляху запиту.
    - **b** (int): Друге число, отримане зі шляху запиту.

    FastAPI автоматично перевірить, чи є введені дані числами.
    """
    return {
        "result": "Додавання",
        "a": a,
        "b": b,
        "result": a + b
    }

# 2. Маршрут для множення /math/multi/{a}/{b}
@router.get(
    "/multi/{a}/{b}",
    summary="Множення двох чисел",
    description="Приймає два цілих числа як параметри шляху та повертає результат їх множення."
)
async def multiply_numbers(a: int, b: int):
    """
    Виконує арифметичне множення двох цілих чисел.

    Повертає JSON-об'єкт з вхідними даними та розрахованим результатом.
    """
    return {
        "result": "Множення",
        "a": a,
        "b": b,
        "result": a * b
    }
